erp3l/src/Documents/ВводВНАВЭксплуатациюМСФО/ВводВНАВЭксплуатациюМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводВНАВЭксплуатациюМСФО</name>
  <registerRecords>InformationRegister.ПараметрыАмортизацииВНАМСФО</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияВНАМСФО</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеВНА</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьВНАМСФО</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаВНАМСФО</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаполнения</name>
    <type>
      <types>EnumRef.РежимЗаполненияВидовУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассВНА</name>
    <type>
      <types>EnumRef.КлассыВНА</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВНА</name>
    <attributes>
      <name>ВНА</name>
      <type>
        <types>DefinedType.ИсточникВНА</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаВНА</name>
      <type>
        <types>CatalogRef.ГруппыВНАМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскоренияМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскоренияНСБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемВыработкиМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемВыработкиНСБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработкиМСФО</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиВНА</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработкиНСБУ</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиВНА</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыАмортизацииВНАМСФО</name>
      <type>
        <types>CatalogRef.ПараметрыАмортизацииВНАМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимостьМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимостьНСБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособНачисленияАмортизацииМСФО</name>
      <type>
        <types>EnumRef.СпособыНачисленияАмортизацииВНА</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособНачисленияАмортизацииНСБУ</name>
      <type>
        <types>EnumRef.СпособыНачисленияАмортизацииВНА</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияРасходовПоАмортизацииМСФО</name>
      <type>
        <types>CatalogRef.СпособыОтраженияРасходовПоАмортизацииМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияРасходовПоАмортизацииНСБУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПоступления</name>
      <type>
        <types>EnumRef.СпособыПоступленияОбъектовВНА</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользованияМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользованияНСБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииМСФО</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииНСБУ</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииСубконто1МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииСубконто1НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииСубконто2МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииСубконто2НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииСубконто3МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетАмортизацииСубконто3НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияМСФО</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияНСБУ</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияСубконто1МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияСубконто1НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияСубконто2МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияСубконто2НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияСубконто3МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПоступленияСубконто3НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаМСФО</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНСБУ</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаСубконто1МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаСубконто1НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаСубконто2МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаСубконто2НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаСубконто3МСФО</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаСубконто3НСБУ</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СторнироватьДанныеНСБУ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьНСБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ВводВНАВЭксплуатациюМСФО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);	
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		
		ИнициализироватьДокумент();
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда 
		
		Если ДанныеЗаполнения.Свойство("СтруктураДействий") Тогда 
			
			Документы.ВводВНАВЭксплуатациюМСФО.ЗаполнитьСтроки(ЭтотОбъект.ВНА, ЭтотОбъект, ДанныеЗаполнения.СтруктураДействий);
		
		ИначеЕсли ДанныеЗаполнения.Свойство("ИсточникЗаполнения") 
			И ДанныеЗаполнения.ИсточникЗаполнения = "ДанныеНСБУ" Тогда
			
			ЗаполнитьИзПодсистемыНСБУ(Неопределено);
			
		ИначеЕсли ДанныеЗаполнения.Свойство("АдресТаблицы") Тогда
			
			МСФОВызовСервераУХ.ЗаполнитьПоТаблицеЗагрузки(ЭтотОбъект, ДанныеЗаполнения);
			
		ИначеЕсли ДанныеЗаполнения.Свойство("ИсточникЗаполнения")
			И ДанныеЗаполнения.ИсточникЗаполнения = "ДокументыОснования" Тогда
			
			ЗаполнитьПоОснованиям(ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"));
			
		Иначе
			
			ИнициализироватьДокумент();
			
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(Ссылка) = ТипДанныхЗаполнения Тогда
		
		ИнициализироватьДокумент(ДанныеЗаполнения);
		ЗаполнитьПоОснованиям(ДанныеЗаполнения, Истина);
		
	ИначеЕсли Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		
		ЗаполнитьПоОснованиям(ДанныеЗаполнения);
		
	Иначе
		
		ИнициализироватьДокумент();
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("ВНА.СпособНачисленияАмортизацииМСФО");
	НепроверяемыеРеквизиты.Добавить("ВНА.СрокПолезногоИспользованияМСФО");
	НепроверяемыеРеквизиты.Добавить("ВНА.КоэффициентУскоренияМСФО");
	НепроверяемыеРеквизиты.Добавить("ВНА.ОбъемВыработкиМСФО");
	НепроверяемыеРеквизиты.Добавить("ВНА.ПараметрВыработкиМСФО");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	МСФОВНАВызовСервераУХ.ОбновитьПроверяемыеРеквизитыТаблицыПоРежимуЗаполнения(ПроверяемыеРеквизиты, ЭтотОбъект, "ВНА");
	// Проверим заполнение полей СПИ в таб части.
	// -Определим режим заполнения.
	ЕстьРежимМСФО = Ложь;
	ТекРежим = ЭтотОбъект.РежимЗаполнения;
	Если ТекРежим = Перечисления.РежимЗаполненияВидовУчета.НСБУ Тогда
		ЕстьРежимМСФО = Ложь;
	ИначеЕсли ТекРежим = Перечисления.РежимЗаполненияВидовУчета.МСФО Тогда
		ЕстьРежимМСФО = Истина;
	ИначеЕсли ТекРежим = Перечисления.РежимЗаполненияВидовУчета.НСБУИМСФО Тогда
		ЕстьРежимМСФО = Истина;
	ИначеЕсли ТекРежим = Перечисления.РежимЗаполненияВидовУчета.ПустаяСсылка() Тогда
		ЕстьРежимМСФО = Ложь;
	Иначе
		ЕстьРежимМСФО = Ложь;
		ТекстСообщения = НСтр("ru = 'Неизвестный режим заполнения видов учёта: %Режим%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Режим%", Строка(ТекРежим));
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
	
	// -Проверим таб части на заполнение СПИ.
	Если Не ЕстьРежимМСФО Тогда
		Возврат; // Не проверяем СПИ в части МСФО.
	КонецЕсли;
	
	СпособНачисленияПропорционально = Перечисления.СпособыНачисленияАмортизацииВНА.ПропорциональноОбъемуПродукции;	
	Для Каждого ТекВНА Из ЭтотОбъект.ВНА Цикл
		
		Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекВНА.ГруппаВНА, "НачислятьАмортизацию") Тогда 
			Продолжить;
		ИначеЕсли ТекВНА.СпособНачисленияАмортизацииМСФО.Пустая() Тогда
			
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Для ВНА %ВНА% не указан <Способ начисления амортизации (МСФО)>. Операция отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВНА%", Строка(ТекВНА.ВНА));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			Продолжить;
			
		КонецЕсли;
		
		НачислениеПропорционально = (ТекВНА.СпособНачисленияАмортизацииМСФО = СпособНачисленияПропорционально);
		Если (НЕ НачислениеПропорционально) И (НЕ ЗначениеЗаполнено(ТекВНА.СрокПолезногоИспользованияМСФО)) Тогда
			
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Для ВНА %ВНА% не указан срок полезного использования по МСФО. Операция отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВНА%", Строка(ТекВНА.ВНА));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			
		ИначеЕсли НачислениеПропорционально Тогда 
			
			Если Не ЗначениеЗаполнено(ТекВНА.ОбъемВыработкиМСФО) Тогда
				
				Отказ = Истина;
				ТекстСообщения = НСтр("ru = 'Для ВНА %ВНА% не указан объем выработки по МСФО. Операция отменена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВНА%", Строка(ТекВНА.ВНА));
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				
			КонецЕсли;
			
			Если ТекВНА.ПараметрВыработкиМСФО.Пустая() Тогда
				
				Отказ = Истина;
				ТекстСообщения = НСтр("ru = 'Для ВНА %ВНА% не указан параметр выработки по МСФО. Операция отменена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВНА%", Строка(ТекВНА.ВНА));
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	ПроведениеСерверУХ.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	ПараметрыПроведения = Документы.ВводВНАВЭксплуатациюМСФО.ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ВводВНАВЭксплуатациюМСФО.СформироватьДвижения(Движения, ДополнительныеСвойства, Отказ);
	
	ПроведениеСерверУХ.ОбработкаПроведения_ЗаписьИКонтроль(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)	
	ПроведениеСерверУХ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Процедура ИнициализироватьДокумент(ДокументИсточник = Неопределено)
	
	Если ДокументИсточник <> Неопределено Тогда
		
		СвойстваЗаполнения = "Организация,Сценарий,КлассВНА";
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументИсточник, СвойстваЗаполнения);
		ЭтотОбъект.РежимЗаполнения = Перечисления.РежимЗаполненияВидовУчета.МСФО;
		
	КонецЕсли;
	
	МСФОУХ.ОбработкаЗаполнения(ЭтотОбъект, ДокументИсточник, РежимЗаполнения);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаполнения

Процедура ЗаполнитьПоОснованиям(МассивДокументыОснования, ЗаполнитьДокумент = Ложь)
	
	Если ЭтотОбъект.РежимЗаполнения = ПредопределенноеЗначение("Перечисление.РежимЗаполненияВидовУчета.МСФО") Тогда
	
		Если ЗаполнитьДокумент Тогда
			МСФОВызовСервераУХ.ЗаполнитьКонтекстПоОснованиям(ЭтотОбъект, МассивДокументыОснования);
		КонецЕсли;
		
		МСФОВызовСервераУХ.ЗаполнитьДокументИзРежимаНСБУ(
								ЭтотОбъект, 
								МассивДокументыОснования, 
								"ВНА");
								
	Иначе
		ЗаполнитьИзПодсистемыНСБУ(МассивДокументыОснования);
	КонецЕсли;	
		
КонецПроцедуры

Процедура ЗаполнитьИзПодсистемыНСБУ(ДокументыОснованияИсточник = Неопределено)
	
	ПараметрыЗаполнения = МСФОКлиентСерверУХ.ПолучитьПараметрыЗаполнения(ЭтотОбъект, ДокументыОснованияИсточник);
	ИсточникЗаполнения = МСФОВНАУХ.ПолучитьДанные_ВводВЭксплуатациюВНА(ПараметрыЗаполнения);
	
	ЭтотОбъект.ВНА.Загрузить(ИсточникЗаполнения.ВНА);
	ЭтотОбъект.ДокументыОснования.Загрузить(ИсточникЗаполнения.ДокументыОснования);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
